Revit 2026 API

# XYZAngleTo Method

---

Returns the angle between this vector and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AngleTo(
	XYZ source
)
```
```vb
Public Function AngleTo (
	source As XYZ
) As Double
```
```cpp
public:
double AngleTo(
	XYZ^ source
)
```
```fsharp
member AngleTo :
        source : XYZ -> float
```

#### Parameters

source XYZ
    The specified vector.

#### Return Value

DoubleThe real number between 0 and PI equal to the angle between the two vectors in radians..

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The angle between the two vectors is measured in the plane spanned by them.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace